cloudrisenx/wanaraseta_gate/wanaraseta_gate/ESP32main/main.cpp
    function forgetWifi() {
      if (confirm('Yakin ingin menghapus WiFi? Alat akan restart ke mode setup Hotspot.')) {
        fetch('/forget_wifi')
          .then(() => showOverlay('Menghapus WiFi', 'Alat akan restart dan masuk ke mode Setup (Wanara_Gate_Setup)', 15))
          .catch(() => showToast('Gagal mereset WiFi', false));
      }
    }

    function triggerRelay(num) {
      let r = document.getElementById('r' + num + '-status');
      if (r) {
        r.innerText = '⏳ MENGIRIM...';
        r.className = 'status-value text-orange';
      }
      fetch('/trigger_relay?relay=' + num + '&t=' + Date.now())
        .then(res => {
          if (res.ok) {
            showToast('Relay ' + num + ' Berhasil Dipicu!');
            if (r) {
              r.innerText = num === 1 ? '✅ DIPICU' : '🔔 DIPICU';
              r.className = num === 1 ? 'status-value text-green' : 'status-value text-orange';
            }
          } else {
            showToast('Gagal memicu relay', false);
            if (r) {
              r.innerText = '❌ GAGAL';
              r.className = 'status-value text-red';
            }
          }
        })
        .catch(() => showToast('Error komunikasi', false));
    }

    function rebootDevice() {
      if (confirm('Merestart board ESP32?')) {
        fetch('/reboot')
          .then(() => showOverlay('Rebooting Device', 'Mencoba menghubungi board', 10))
          .catch(() => showToast('Gagal memproses reboot', false));
      }
    }

    document.getElementById('form-folder').addEventListener('submit', function(e) {
      e.preventDefault();
      fetch('/save_folder', {
        method: 'POST',
        body: new URLSearchParams(new FormData(this))
      })
      .then(() => showOverlay('Mengubah Target Folder', 'Merestart board untuk memuat setelan', 8))
      .catch(() => showToast('Gagal merubah folder', false));
    });

    document.getElementById('form-mqtt').addEventListener('submit', function(e) {
      e.preventDefault();
      fetch('/save_mqtt', {
        method: 'POST',
        body: new URLSearchParams(new FormData(this))
      })
      .then(() => showOverlay('Menyimpan MQTT Broker', 'Menerapkan setelan broker baru', 8))
      .catch(() => showToast('Gagal menyimpan MQTT', false));
    });

    document.getElementById('form-master').addEventListener('submit', function(e) {
      e.preventDefault();
      fetch('/save_master', {
        method: 'POST',
        body: new URLSearchParams(new FormData(this))
      })
      .then(() => showOverlay('Menyimpan Kartu Master', 'Menerapkan UID kartu master baru', 8))
      .catch(() => showToast('Gagal menyimpan kartu master', false));
    });

    // Show/hide scanner type berdasarkan device type
    (function() {
      var selDev = document.getElementById('sel-device-type');
      var grpScanner = document.getElementById('scanner-type-group');
      if (!selDev || !grpScanner) return;
      function updateScannerGroup() {
        grpScanner.style.display = selDev.value === 'gate' ? '' : 'none';
      }
      selDev.addEventListener('change', updateScannerGroup);
      updateScannerGroup();
    })();

    document.getElementById('file-input').addEventListener('change', function() {
      let label = this.files.length > 0 ? this.files[0].name : 'Seret file ke sini atau klik untuk memilih';
      document.getElementById('file-name-display').innerText = label;
    });

    document.getElementById('form-upload').addEventListener('submit', function(e) {
      e.preventDefault();
      let fileInput = document.getElementById('file-input');
      if (fileInput.files.length === 0) {
        showToast('Pilih file .bin terlebih dahulu!', false);
        return;
      }
      if (!confirm('Apakah Anda yakin ingin meng-upload dan men-flash file ini secara manual?')) {
        return;
      }

      let file = fileInput.files[0];
      let formData = new FormData();
      formData.append('update', file);

      let xhr = new XMLHttpRequest();
      xhr.open('POST', '/update', true);

      let container = document.getElementById('progress-container');
      let bar = document.getElementById('progress-bar');
      let percentText = document.getElementById('progress-percent');
      let statusText = document.getElementById('progress-status');

      container.style.display = 'block';
      statusText.innerText = 'Mengunggah file...';
      bar.style.width = '0%';
      percentText.innerText = '0%';

      xhr.upload.addEventListener('progress', function(event) {
        if (event.lengthComputable) {
          let percent = Math.round((event.loaded / event.total) * 100);
          bar.style.width = percent + '%';
          percentText.innerText = percent + '%';
          if (percent === 100) {
            statusText.innerText = 'Menulis ke Flash... (Jangan Matikan Board)';
          }
        }
      });

      xhr.onreadystatechange = function() {
        if (xhr.readyState === 4) {
          if (xhr.status === 200) {
            statusText.innerText = 'Flash Berhasil! Board merestart...';
            showOverlay('Update Manual Berhasil', 'Firmware baru terpasang, board sedang reboot', 10);
          } else {
            statusText.innerText = 'Gagal: ' + xhr.responseText;
            showToast('Gagal meng-upload firmware: ' + xhr.responseText, false);
          }
        }
      };
      xhr.send(formData);
    });
  </script>
</body>
</html>
)rawliteral";

void handleRoot() {
  server.sendHeader("Cache-Control", "no-cache, no-store, must-revalidate");
  server.sendHeader("Pragma", "no-cache");
  server.sendHeader("Expires", "-1");

  String html = String(INDEX_HTML);
  
  // Replace string template saat dimuat pertama kali
  html.replace("{{VERSION}}", APP_VERSION);
  html.replace("{{FOLDER}}", folderAktif);
  html.replace("{{SEL_ESP32MAIN}}", folderAktif == "ESP32main" ? "selected" : "");
  html.replace("{{SEL_ESP32TEST}}", folderAktif == "ESP32_test" ? "selected" : "");
  html.replace("{{SEL_WT32MAIN}}", folderAktif == "WT32main" ? "selected" : "");
  html.replace("{{SEL_WT32TEST}}", folderAktif == "WT32_test" ? "selected" : "");
  html.replace("{{SEL_SRCMAINOTA}}", folderAktif == "src_mainOTA" ? "selected" : "");

  html.replace("{{MQTT_SERVER}}", mqtt_server);
  html.replace("{{MQTT_PORT}}", String(mqtt_port));
  html.replace("{{MQTT_USER}}", mqtt_user);
  html.replace("{{MQTT_PASS}}", mqtt_pass);
  html.replace("{{MQTT_CLIENT_ID}}", mqtt_client_id);
  html.replace("{{RFID_MASTER}}", rfid_master);
  html.replace("{{SEL_DEVICE_GATE}}", device_type == "gate" ? "selected" : "");
  html.replace("{{SEL_DEVICE_KASIR}}", device_type == "kasir" ? "selected" : "");
  html.replace("{{SEL_SCANNER_RFID}}", scanner_type == "rfid" ? "selected" : "");
  html.replace("{{SEL_SCANNER_QR}}", scanner_type == "qr" ? "selected" : "");
  html.replace("{{TOPIC_PUB}}", device_type + "/" + mqtt_client_id + "/scan/in");
  html.replace("{{TOPIC_SUB}}", device_type + "/" + mqtt_client_id + "/result");

  server.send(200, "text/html", html);
}

