cloudrisenx/wanaraseta_gate/wanaraseta_gate/ESP32main/main.cpp
void handleStatusData() {
  server.sendHeader("Cache-Control", "no-cache, no-store, must-revalidate");
  server.sendHeader("Pragma", "no-cache");
  server.sendHeader("Expires", "-1");

  JsonDocument doc;
  doc["version"]       = APP_VERSION;
  doc["folder"]        = folderAktif;
  doc["free_heap"]     = ESP.getFreeHeap();
  doc["min_free_heap"] = ESP.getMinFreeHeap();
  doc["uptime"]        = millis() / 1000;
  doc["rfid_status"]   = rfidStatus;

  byte v = mfrc522.PCD_ReadRegister(mfrc522.VersionReg);
  char verStr[10];
  sprintf(verStr, "0x%02X", v);
  doc["rfid_version"]  = verStr;
  doc["last_rfid"]     = lastRfidScan;
  doc["last_barcode"]  = lastBarcodeScan;

  bool wifiCon = (WiFi.status() == WL_CONNECTED);
  doc["wifi_status"]   = wifiCon ? "Connected" : "Disconnected";
  doc["wifi_ssid"]     = wifiCon ? WiFi.SSID() : (wm.getWiFiIsSaved() ? WiFi.SSID() : "-");
  doc["wifi_rssi"]     = wifiCon ? String(WiFi.RSSI()) : "0";
  doc["wifi_ip"]       = WiFi.localIP().toString();

  doc["mqtt_status"]   = mqttClient.connected() ? "Connected" : "Disconnected";
  doc["mqtt_broker"]   = mqtt_server;
  doc["mqtt_port"]     = mqtt_port;
  doc["mqtt_client_id"]= mqtt_client_id;
  doc["relay1"]        = isRelay1Active;
  doc["relay2"]        = isRelay2Active;
  doc["device_type"]   = device_type;
  doc["scanner_type"]  = scanner_type;
  doc["mqtt_topic_pub"]= device_type + "/" + mqtt_client_id + "/scan/in";
  doc["mqtt_topic_sub"]= device_type + "/" + mqtt_client_id + "/result";
  doc["touch_active"]  = isTouching;

  String output;
  serializeJson(doc, output);
  server.send(200, "application/json", output);
}

void handleReconnectWifi() {
  server.send(200, "text/plain", "Reconnecting");
  if (wm.getWiFiIsSaved()) {
    Serial.println("[WIFI] Perintah reconnect manual via Web...");
    WiFi.disconnect();
    WiFi.begin(); // Reconnect pakai kredensial tersimpan
  }
}

void handleForgetWifi() {
  server.send(200, "text/plain", "OK");
  Serial.println("[WIFI] Perintah Forget WiFi diterima. Menghapus kredensial...");
  delay(1000);
  wm.resetSettings(); // Menghapus SSID & Password dari NVS ESP32
  esp_task_wdt_delete(NULL); 
  ESP.restart();
}

void handleSaveFolder() {
  if (server.hasArg("folder_name")) {
    String newFolder = server.arg("folder_name");
    preferences.begin("gate_config", false);
    preferences.putString("ota_folder", newFolder);
    preferences.end();

    server.send(200, "text/plain", "OK");
    pendingRestart = true;
    restartTime = millis();
  } else {
    server.send(400, "text/plain", "Bad Request");
  }
}

void handleSaveMqtt() {
  if (server.hasArg("mqtt_server")) {
    mqtt_server    = server.arg("mqtt_server");
    mqtt_port      = server.arg("mqtt_port").toInt();
    mqtt_user      = server.arg("mqtt_user");
    mqtt_pass      = server.arg("mqtt_pass");
    mqtt_client_id = server.arg("mqtt_client_id");
    if (server.hasArg("device_type"))  device_type  = server.arg("device_type");
    if (server.hasArg("scanner_type")) scanner_type = server.arg("scanner_type");

    preferences.begin("gate_config", false);
    preferences.putString("mqtt_server", mqtt_server);
    preferences.putInt("mqtt_port", mqtt_port);
    preferences.putString("mqtt_user", mqtt_user);
    preferences.putString("mqtt_pass", mqtt_pass);
    preferences.putString("mqtt_client_id", mqtt_client_id);
    preferences.putString("device_type", device_type);
    preferences.putString("scanner_type", scanner_type);
    preferences.end();

    server.send(200, "text/plain", "OK");
    pendingRestart = true;
    restartTime = millis();
  } else {
    server.send(400, "text/plain", "Bad Request");
  }
}

void handleSaveMaster() {
  if (server.hasArg("rfid_master")) {
    rfid_master = server.arg("rfid_master");
    rfid_master.toUpperCase();
    rfid_master.trim();

    preferences.begin("gate_config", false);
    preferences.putString("rfid_master", rfid_master);
    preferences.end();

    server.send(200, "text/plain", "OK");
    pendingRestart = true;
    restartTime = millis();
  } else {
    server.send(400, "text/plain", "Bad Request");
  }
}

void handleTriggerRelay() {
  server.sendHeader("Cache-Control", "no-cache, no-store, must-revalidate");
  server.sendHeader("Pragma", "no-cache");
  server.sendHeader("Expires", "-1");

  if (server.hasArg("relay")) {
    int rNum = server.arg("relay").toInt();
    if (rNum == 1 || rNum == 2) {
      triggerRelay(rNum);
      server.send(200, "text/plain", "Relay " + String(rNum) + " triggered");
    } else {
      server.send(400, "text/plain", "Invalid relay number");
    }
  } else {
    server.send(400, "text/plain", "Missing parameter");
  }
}

void handleReboot() {
  server.send(200, "text/plain", "Rebooting");
  pendingRestart = true;
  restartTime = millis();
}

void handleCekUpdate() {
  String html = "<html><head><meta charset='UTF-8'><meta name='viewport' content='width=device-width, initial-scale=1'><meta http-equiv='refresh' content='2;url=/do_update'><style>body{background:#0b0c10;color:#f3f4f6;text-align:center;padding:50px;font-family:sans-serif;} .loader{border:3px solid rgba(255,255,255,0.08);border-top:3px solid #6366f1;border-radius:50%;width:40px;height:40px;animation:spin 1s linear infinite;margin:20px auto;} @keyframes spin{0%{transform:rotate(0deg);}100%{transform:rotate(360deg);}}</style></head><body><h2>Menghubungi GitHub...</h2><div class='loader'></div><p style='color:#9ca3af;'>Mengunduh manifest pembaruan secara secure...</p></body></html>";
  server.send(200, "text/html", html);
}

void handleDoUpdate() {
  server.setContentLength(CONTENT_LENGTH_UNKNOWN);
  server.send(200, "text/html", ""); // Live streaming log

  String htmlStart = R"rawliteral(
  <!DOCTYPE html>
  <html>
  <head>
    <meta charset='UTF-8'>
    <meta name='viewport' content='width=device-width, initial-scale=1'>
    <title>OTA - Wanara Seta</title>
    <link href="https://fonts.googleapis.com/css2?family=Outfit:wght@400;600&family=JetBrains+Mono&display=swap" rel="stylesheet">
    <style>
      body { background: #0b0c10; color: #f3f4f6; font-family: 'Outfit', sans-serif; text-align: center; padding: 40px 20px; margin: 0; }
      .box { max-width: 600px; margin: 0 auto; padding: 30px; background: rgba(22, 25, 41, 0.75); border: 1px solid rgba(255,255,255,0.08); border-radius: 16px; }
      h2 { margin-top: 0; margin-bottom: 20px; font-weight: 600; color: #fff; }
      pre { background: #000; padding: 20px; border: 1px solid rgba(255, 255, 255, 0.05); border-radius: 8px; text-align: left; overflow-x: auto; color: #10b981; font-family: 'JetBrains Mono', monospace; font-size: 12.5px; white-space: pre-wrap; word-wrap: break-word; line-height: 1.5; }
      .btn { display: inline-block; background: linear-gradient(135deg, #6366f1, #4f46e5); color: #fff; padding: 11px 22px; text-decoration: none; border-radius: 6px; font-weight: 600; margin-top: 20px; }
    </style>
  </head>
  <body>
    <div class='box'>
      <h2>Hasil Update OTA GitHub</h2>
      <pre>)rawliteral";

  server.sendContent(htmlStart);
  cekUpdateGitHub(true);
  server.sendContent("</pre><a href='/' class='btn'>KEMBALI KE DASHBOARD</a></div></body></html>");
  server.sendContent("");
}

