cloudrisenx/wanaraseta_gate/wanaraseta_gate/ESP32main/main.cpp
// Handler POST dari Manual Upload
void handleManualUpdate() {
  server.sendHeader("Connection", "close");
  if (Update.hasError()) {
    server.send(500, "text/plain", String("Upload Error: ") + Update.errorString());
  } else {
    server.send(200, "text/plain", "OK");
    delay(1000);
    ESP.restart();
  }
}

// Handler penulisan chunk file Manual Upload
void handleManualUpload() {
  HTTPUpload& upload = server.upload();
  static bool hasError = false;
  
  if (upload.status == UPLOAD_FILE_START) {
    Serial.printf("[UPLOAD] Mulai upload manual: %s\n", upload.filename.c_str());
    hasError = false;
    
    // Nonaktifkan peripheral dan brownout detector sebelum flashing manual
    prepareForOTA();
    
    if (!Update.begin(UPDATE_SIZE_UNKNOWN)) {
      Update.printError(Serial);
      hasError = true;
    }
  } else if (upload.status == UPLOAD_FILE_WRITE) {
    if (!hasError) {
      if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
        Update.printError(Serial);
        hasError = true;
      }
    }
  } else if (upload.status == UPLOAD_FILE_END) {
    if (!hasError) {
      if (Update.end(true)) {
        Serial.printf("[UPLOAD] Selesai! Ukuran: %u bytes\n", upload.totalSize);
      } else {
        Update.printError(Serial);
        hasError = true;
      }
    }
    // Kembalikan konfigurasi jika update gagal (jika sukses board langsung restart)
    if (hasError) {
      restoreAfterOTA();
    }
  }
}

// ========================================================================
// 6. KONTROL GERBANG & TIMER RELAY
// ========================================================================
void triggerRelay(int relayNum) {
  if (relayNum == 1) {
    isRelay1Active = true;
    relay1ActiveTime = millis();
    digitalWrite(RELAY1_PIN, RELAY_ACTIVE);
    Serial.println("[GATE] Relay 1 Aktif (Gerbang Terbuka)");
  } else if (relayNum == 2) {
    isRelay2Active = true;
    relay2ActiveTime = millis();
    digitalWrite(RELAY2_PIN, RELAY_ACTIVE);
    Serial.println("[GATE] Relay 2 Aktif (Alarm/Aux Terbuka)");
  }
  
  // Jadwalkan soft-reinit RFID Non-Blocking untuk mengatasi noise EMI
  pendingRfidReinit = true;
  pendingRfidReinitTime = millis();
}

void handleGate() {
  bool relayJustClosed = false;

  if (isRelay1Active && (millis() - relay1ActiveTime > GATE_OPEN_MS)) {
    isRelay1Active = false;
    digitalWrite(RELAY1_PIN, RELAY_DEACTIVE);
    Serial.println("[GATE] Relay 1 Mati (Gerbang Tertutup)");
    relayJustClosed = true;
  }
  if (isRelay2Active && (millis() - relay2ActiveTime > GATE_OPEN_MS)) {
    isRelay2Active = false;
    digitalWrite(RELAY2_PIN, RELAY_DEACTIVE);
    Serial.println("[GATE] Relay 2 Mati (Alarm/Aux Tertutup)");
    relayJustClosed = true;
  }

  if (relayJustClosed) {
    // Jadwalkan soft-reinit RFID Non-Blocking untuk mengatasi noise EMI
    pendingRfidReinit = true;
    pendingRfidReinitTime = millis();
  }
}

// ========================================================================
// 7. CALLBACK & KONEKSI MQTT
// ========================================================================
void mqttCallback(char* topic, byte* payload, unsigned int length) {
  String message = "";
  for (unsigned int i = 0; i < length; i++) {
    message += (char)payload[i];
  }
  Serial.printf("\n[MQTT] Pesan masuk di topik: %s\n", topic);
  Serial.println("[MQTT] Payload: " + message);

  JsonDocument doc;
  DeserializationError error = deserializeJson(doc, message);
  if (error) {
    Serial.println("[JSON] Gagal mem-parsing payload MQTT.");
    return;
  }

  String topicStr = String(topic);
  String resTopic = device_type + "/" + mqtt_client_id + "/result";
  String cmdTopic = device_type + "/" + mqtt_client_id + "/command";

  if (topicStr == resTopic) {
    String status = doc["status"];
    if (status == "valid") {
      Serial.println("[AKSES] Valid! Pesan: " + doc["message"].as<String>());
      triggerRelay(1);
    } else if (status == "invalid") {
      Serial.println("[AKSES] Ditolak! Alasan: " + doc["message"].as<String>());
    }
  } 
  else if (topicStr == cmdTopic) {
    String cmd = doc["command"];
    if (cmd == "open_gate") {
      Serial.println("[COMMAND] Perintah Buka Gerbang Utama!");
      triggerRelay(1);
    } else if (cmd == "open_gate_2") {
      Serial.println("[COMMAND] Perintah Buka Relay 2 / Alarm!");
      triggerRelay(2);
    } else if (cmd == "reboot") {
      Serial.println("[COMMAND] Perintah Reboot dari server. Restarting...");
      esp_task_wdt_delete(NULL); 
      delay(1000);
      ESP.restart();
    }
  }
}

void reconnectMQTT() {
  Serial.printf("[MQTT] Melakukan koneksi ke broker EMQX %s:%d...\n", mqtt_server.c_str(), mqtt_port);
  
  // TCP Ping Cepat (Timeout maksimal 1 detik)
  // Mencegah fungsi koneksi mem-blokir program selama 15 detik jika IP/Server sedang mati
  WiFiClient pingClient;
  if (!pingClient.connect(mqtt_server.c_str(), mqtt_port, 1000)) {
    Serial.println("[MQTT] ERROR: Broker tidak merespon / IP tidak dapat dijangkau.");
    return; // Langsung keluar agar sistem & WDT tetap berjalan normal
  }
  pingClient.stop(); // Port terbuka! Tutup ping socket

  // Set timeout (3 detik) pada client agar reconnect tidak memblokir WDT
  espClient.setTimeout(3000);

  // Beri makan WDT sebelum proses koneksi yang memakan waktu (blocking)
  esp_task_wdt_reset();

  bool connected = false;
  if (mqtt_user.length() > 0) {
    connected = mqttClient.connect(mqtt_client_id.c_str(), mqtt_user.c_str(), mqtt_pass.c_str());
  } else {
    connected = mqttClient.connect(mqtt_client_id.c_str());
  }

  // Beri makan WDT setelah selesai proses koneksi
  esp_task_wdt_reset();

  if (connected) {
    Serial.println("[MQTT] Terhubung!");
    
    String resTopic = device_type + "/" + mqtt_client_id + "/result";
    String cmdTopic = device_type + "/" + mqtt_client_id + "/command";
    
    mqttClient.subscribe(resTopic.c_str());
    mqttClient.subscribe(cmdTopic.c_str());
    
    Serial.println("[MQTT] Berhasil subscribe ke topik result & command.");
  } else {
    Serial.print("[MQTT] Gagal terhubung ke broker, rc=");
    Serial.println(mqttClient.state());
  }
}

// ========================================================================
// 8. SETUP & LOOP
// ========================================================================
void setup() {
  // Nonaktifkan brownout detector agar tidak reset saat WiFi radio aktif
  WRITE_PERI_REG(RTC_CNTL_BROWN_OUT_REG, 0);

