cloudrisenx/wanaraseta_gate/wanaraseta_gate/ESP32main/main.cpp
  Serial.begin(115200);
  delay(1000);

  // Ambil data konfigurasi dari memori internal (NVS)
  preferences.begin("gate_config", true);
  folderAktif    = preferences.getString("ota_folder", "ESP32main");
  savedApSSID    = preferences.getString("ap_ssid", DEFAULT_AP_SSID);
  mqtt_server    = preferences.getString("mqtt_server", mqtt_server);
  mqtt_port      = preferences.getInt("mqtt_port", mqtt_port);
  mqtt_user      = preferences.getString("mqtt_user", mqtt_user);
  mqtt_pass      = preferences.getString("mqtt_pass", mqtt_pass);
  mqtt_client_id = preferences.getString("mqtt_client_id", mqtt_client_id);
  rfid_master    = preferences.getString("rfid_master", rfid_master);
  device_type    = preferences.getString("device_type", "gate");
  scanner_type   = preferences.getString("scanner_type", "rfid");
  preferences.end();

  // Pastikan Client ID unik dengan menambahkan suffix MAC address jika masih default atau kosong
  if (mqtt_client_id == "gate_esp32_01" || mqtt_client_id.length() == 0) {
    uint8_t mac[6];
    esp_read_mac(mac, ESP_MAC_WIFI_STA);
    char macSuffix[16];
    sprintf(macSuffix, "_%02X%02X%02X", mac[3], mac[4], mac[5]);
    mqtt_client_id = "gate_esp32_01" + String(macSuffix);
    Serial.println("[MQTT] Client ID default terdeteksi. Menggunakan ID unik: " + mqtt_client_id);
  }

  // Konfigurasi WiFiManager
  wm.setConnectTimeout(15);       // Coba konek ke router maksimal 15 detik
  wm.setConfigPortalTimeout(180); // Portal AP otomatis tutup setelah 3 menit jika tidak diisi
  wm.setConnectRetries(3);        // Coba reconnect 3x sebelum menyerah

  Serial.println("\n[WIFI] Mencoba terhubung ke jaringan...");
  bool wifiOk = wm.autoConnect(savedApSSID.c_str(), DEFAULT_AP_PASSWORD);

  if (!wifiOk) {
    // Gagal konek dan portal timeout — buka ulang AP untuk debug
    Serial.println("[WIFI] autoConnect gagal / timeout. Membuka Hotspot debug...");
    wm.startConfigPortal(savedApSSID.c_str(), DEFAULT_AP_PASSWORD);
    Serial.println("[WIFI] Mode Hotspot aktif. Hubungkan ke '" + savedApSSID + "' untuk konfigurasi.");
  } else {
    Serial.println("[WIFI] Sukses Terhubung! IP Web Dashboard: " + WiFi.localIP().toString());
  }

  // Routing Halaman Web
  server.on("/", handleRoot);
  server.on("/status_data", HTTP_GET, handleStatusData);
  server.on("/reconnect_wifi", HTTP_GET, handleReconnectWifi);
  server.on("/forget_wifi", HTTP_GET, handleForgetWifi);
  server.on("/save_folder", HTTP_POST, handleSaveFolder);
  server.on("/save_mqtt", HTTP_POST, handleSaveMqtt);
  server.on("/save_master", HTTP_POST, handleSaveMaster);
  server.on("/trigger_relay", HTTP_GET, handleTriggerRelay);
  server.on("/reboot", HTTP_GET, handleReboot);
  server.on("/cek_update", HTTP_GET, handleCekUpdate);
  server.on("/do_update", HTTP_GET, handleDoUpdate);
  
  // Handler Upload Manual
  server.on("/update", HTTP_POST, handleManualUpdate, handleManualUpload);

  server.begin();

  // Hardware Reset Pulsa via RST Pin sebelum inisialisasi SPI / PCD
  pinMode(RST_PIN, OUTPUT);
  digitalWrite(RST_PIN, LOW);
  delay(20);
  digitalWrite(RST_PIN, HIGH);
  delay(50);

  // Inisialisasi SPI & RFID MFRC522 (VSPI default, gunakan begin tanpa SS_PIN agar CS dikendalikan manual oleh library)
  SPI.begin(SPI_SCK, SPI_MISO, SPI_MOSI); 
  mfrc522.PCD_Init();
  mfrc522.PCD_SetAntennaGain(mfrc522.RxGain_max);

  // Cek versi sensor saat awal boot
  byte v = mfrc522.PCD_ReadRegister(mfrc522.VersionReg);
  Serial.printf("[RFID] Version Register: 0x%02X\n", v);
  if (v == 0x91 || v == 0x92 || v == 0x88 || v == 0x82 || v == 0x12) {
    rfidStatus = "✅ AKTIF";
    Serial.println("[RFID] Sensor MFRC522 terdeteksi dan siap.");
  } else {
    rfidStatus = "❌ TIDAK MERESPON (Cek Pin/Kabel)";
    Serial.println("[RFID] PERHATIAN: Sensor MFRC522 tidak terdeteksi!");
  }

  // Setup Barcode Scanner (UART2)
  Serial2.begin(BARCODE_BAUD, SERIAL_8N1, BARCODE_RX, BARCODE_TX);
  Serial.println("[BARCODE] Scanner UART2 siap.");

  // Setup MQTT Client
  mqttClient.setServer(mqtt_server.c_str(), mqtt_port);
  mqttClient.setCallback(mqttCallback);
  mqttClient.setBufferSize(1024);        // Buffer JSON MQTT diperbesar

  // Aktifkan Task Watchdog Timer
  #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
    esp_task_wdt_config_t twdt_config = {
        .timeout_ms = WDT_TIMEOUT_SECONDS * 1000,
        .idle_core_mask = 0,
        .trigger_panic = true
    };
    esp_task_wdt_reconfigure(&twdt_config);
  #else
    esp_task_wdt_init(WDT_TIMEOUT_SECONDS, true); 
  #endif
  
  esp_task_wdt_add(NULL); 

  // Setup Pin Relay sebagai Output
  pinMode(RELAY1_PIN, OUTPUT);
  pinMode(RELAY2_PIN, OUTPUT);
  digitalWrite(RELAY1_PIN, RELAY_DEACTIVE);
  digitalWrite(RELAY2_PIN, RELAY_DEACTIVE);

  // Setup Pin LED RFID sebagai Output
  pinMode(RFID_LED_PIN, OUTPUT);
  digitalWrite(RFID_LED_PIN, LOW); // Default mati (asumsi Active-HIGH)
}

void loop() {
  server.handleClient(); // Jaga agar server web tetap responsif

  // Touch Pin - Deteksi tahan 10 detik untuk masuk ulang ke WiFi Manager
  {
    uint16_t touchVal = touchRead(TOUCH_PIN);
    if (touchVal < TOUCH_THRESHOLD) {
      if (!isTouching) {
        isTouching = true;
        touchStartTime = millis();
        Serial.println("[TOUCH] GPIO4 disentuh! Tahan 10 detik untuk reset WiFi Manager...");
      } else if (millis() - touchStartTime >= 10000) {
        Serial.println("[TOUCH] 10 detik tercapai! Mereset WiFi Manager dan restart...");
        isTouching = false;
        wm.resetSettings();
        esp_task_wdt_delete(NULL);
        delay(500);
        ESP.restart();
      }
    } else {
      if (isTouching && (millis() - touchStartTime > 500)) {
        Serial.printf("[TOUCH] Dilepas setelah %lums (butuh 10000ms untuk reset)\n", millis() - touchStartTime);
      }
      isTouching = false;
      touchStartTime = 0;
    }
  }

  // Tangani restart tertunda agar respon HTTP terkirim bersih ke browser
  if (pendingRestart && (millis() - restartTime > 2000)) {
    ESP.restart();
  }

  // Status Koneksi
  bool wifiConnected = (WiFi.status() == WL_CONNECTED);
  bool mqttConnected = mqttClient.connected();

  static int wifiReconnectAttempts = 0;
  static unsigned long lastWifiCheck = 0;
  static unsigned long timeAfterFiveAttempts = 0;

  if (wifiConnected) {
    wifiReconnectAttempts = 0;
    timeAfterFiveAttempts = 0;
  }

  // --- LOGIKA RECONNECT WIFI ---
  if (!wifiConnected) {
    // Coba reconnect setiap 10 detik maksimal 5 kali percobaan
    if (millis() - lastWifiCheck > 10000 && wifiReconnectAttempts < 5) {
      lastWifiCheck = millis();
      if (wm.getWiFiIsSaved()) {
        wifiReconnectAttempts++;
        Serial.printf("[WIFI] Terputus! Mencoba menghubungkan ulang ke router... (Percobaan %d/5)\n", wifiReconnectAttempts);
        WiFi.disconnect();
        WiFi.begin(); 
        
        if (wifiReconnectAttempts == 5) {
          timeAfterFiveAttempts = millis(); // Catat waktu setelah percobaan ke-5 selesai
        }
      }
    }
  }

  // --- LOGIKA WATCHDOG TIMER (WDT) ---
  bool feedWDT = true;

  if (wm.getWiFiIsSaved()) {
    // Jika WiFi terputus, sudah 5 kali percobaan, biarkan timeout 1 menit sebelum WDT reset board
    if (!wifiConnected && wifiReconnectAttempts >= 5 && timeAfterFiveAttempts > 0) {
      if (millis() - timeAfterFiveAttempts > 60000) {
        feedWDT = false;
      }
    }
  }

